{
  "confidentiality": {
    "header": "Требования к конфиденциальности",
    "text": "При разработке системы необходимо учитывать требования нормативно-правовых документов в области защиты коммерческой тайны, а также локальных нормативных актов Компании в области информационной безопасности: Федеральный закон «О коммерческой тайне» N 98-ФЗ, «Режим коммерческой тайны», «Конфиденциальная информация» Компании, Политики информационной безопасности Компании, «Инструкция о передаче информации, составляющей коммерческую тайну, и иной конфиденциальной информации органам государственной власти, иным государственным органам, органам местного самоуправления и контрагентам», «Инструкция по конфиденциальному делопроизводству», а также требования нормативно-правовых документов в области защиты персональных данных при их обработке в информационных системах персональных данных, а также локальных нормативных актов Компании в области информационной безопасности: Федеральный закон «О персональных данных» № 152-ФЗ, «Приказ ФСТЭК России от 18 февраля 2013 г. № 21», «Положение об обеспечении безопасности персональных данных при их обработке в ИСПДн», «Положение об обработке персональных данных», «Политика обработки персональных данных». СЗПДн и ПОИБ будут разработаны в рамках проекта Проект1."
  },
  "security": {
    "MainHeader": "Требования к безопасности",
    "paragraphs": [
      {
        "id": 0,
        "header": "Общие требования защиты информации",
        "text": "При проектировании и реализации системы должны быть реализованы требования, указанные в документе «Политика информационной безопасности» и комплексе стандартов Компании в области информационной безопасности, а также в следующих нормативно-методических документах: • Требовании к полномочиям • Контроль исполнения требований ИБ в процессе ведения разработок • Контроль исполнения требований ИБ в процессах интеграции информационных систем."
      },
      {
        "id": 1,
        "header": "Идентификация и аутентификация",
        "text": "Идентификация и аутентификация пользователей в Системе должна производиться на основе групп доступа корпоративного каталога AD путем применения технологии единого входа (Single Sign-on) по учетным записям пользователей. В случае, если пользователь успешно прошёл аутентификацию в AD, но у него отсутствует принадлежность к нужным доменным группам, то в доступе к ИС пользователю должно быть отказано.\nВ Системе должны быть предусмотрены технические учетные записи, предназначенные для идентификации и аутентификации субъектов доступа и их авторизации при создании интеграционных связей со смежными системами и при взаимодействии между компонентами системы при необходимости. Не допускается применение обезличенных (анонимизированных) учетных записей пользователей системы. Ведение учетных записей в ИС должны удовлетворять требованиям \"Требования к ведению УЗ в системах 1С\"."
      },
      {
        "id": 2,
        "header": "Авторизация и управление доступом пользователей к системе",
        "text": "Доступ должен предоставляется только идентифицированным и аутентифицированным пользователям. При размещении проекта в КСПД запрос на доступ должен проходить согласование с владельцем ресурса и ответственными лицами через корпоративную IDM согласно «Предоставление доступа к информационным ресурсам и ИТ сервисам». Разграничение доступа к модулям и функционалу ИС должно основываться на утвержденной ролевой модели, в которой каждая роль соответствует определенному набору разрешений на доступ к функционалу проектного решения. Роли пользователям должны назначаться на основе принципов минимальной необходимости и достаточности. В Active Directory необходимо настроить доменные группы по количеству типов субъектов доступа в ролевой модели. Принадлежность пользователя к одной из этих групп должно однозначно определять роль пользователя в ИС. Определение принадлежности пользователей к доменным группам должно осуществляться за пределами проектного решения посредством IDM. Ведение собственных пользователей в ИС не должно предусматриваться. События безопасности, как «Создание/удаление учетных записей в Системе» и «Отслеживание изменений привилегий учетной записи пользователя», должны регулироваться средствами IDM. Ролевая модель доступа должна удовлетворять требованиям \"Требования к модели полномочий в ИС на базе 1С\". События безопасности, как «Создание/удаление учетных записей в Системе» и «Отслеживание изменений привилегий учетной записи пользователя», должны регулироваться средствами Системы."
      },
      {
        "id": 3,
        "header": "Служебные учетные записи",
        "text": "Серверные службы Системы должны быть настроены на работу под специализированными служебными учетными записями корпоративного домена Компании. Доступ к серверной части приложения осуществляется через ПО3. Парольная политика служебных УЗ должна соответствовать следующим требованиям: • Установка сложного пароля, не менее 22 символов • Включение в группы безопасности: • Deny Logon Locally (Запрет локального входа); • RunAsService; • Исключить политику блокировки УЗ; • Исключить политику смены пароля УЗ через фиксированный интервал времени."
      },
      {
        "id": 4,
        "header": "Контроль целостности данных",
        "text": "Контроль целостности данных должен обеспечиваться на уровне системных возможностей Системы, а также СУБД."
      },
      {
        "id": 5,
        "header": "Криптографическая защита данных",
        "text": "В случае выявления в ходе проекта необходимости организации криптографической защиты данных при их передаче, такой информационный обмен должен быть организован с использованием сертифицированных ФСБ России средств криптографической защиты информации."
      },
      {
        "id": 6,
        "header": "Сетевая безопасность",
        "text": "Сетевая безопасность должна быть реализована в соответствии с требованиями «Политики информационной безопасности» и другими нормативными документами Компании с использованием встроенных средств операционных систем серверов, на которых размещаются компоненты системы, и настройки соответствующих правил корпоративных межсетевых экранов, включающие: • Разделение сетей информационных систем, размещённых в корпоративном облаке IaaS на изолированные сегменты:\n\nРазработка (Dev);\nТестирование (Test);\nПред-продуктив (Preprod);\nПродуктив (Prod).\n• Разграничение доступа пользователей/устройств к информационным ресурсам в разных сетевых сегментах согласно политике ИБ. • Настройка сетевого взаимодействие разных сегментов должна исключать возможность смешивания продуктивных и непродуктивные данных. • Блокирование трафика межсетевого взаимодействия, не соответствующего политике безопасности. • Фильтрация пакетов данных на основе заданных критериев соответствия. • Функции обнаружения и предотвращения вторжений, включая обнаружение вторжений, их предотвращение и обновление базы решающих правил. • Реализация мероприятий по обеспечению сетевой безопасности должна обеспечиваться за счет применения имеющихся и применяемых у Заказчика средств межсетевого экранирования."
      },
      {
        "id": 7,
        "header": "Контроль защищенности",
        "text": "Контроль защищенности может выполняться как с использованием специализированных средств контроля защищенности, так и с помощью встроенных в системное и прикладное ПО средств. Используемые средства контроля защищенности должны обеспечивать реализацию следующих функций: • инвентаризационное сканирование информационных ресурсов; • выявление уязвимостей в программно-аппаратном обеспечении на основе полных или выборочных тестов прикладного и общесистемного ПО; • определение значений параметров безопасности прикладного и общесистемного ПО; • создание отчётов с различными уровнями детализации."
      },
      {
        "id": 8,
        "header": "Регистрация и аудит событий",
        "text": "Средствами ПО в Системе должны осуществляться: • Сбор, запись и хранение информации о событиях безопасности в течение установленного времени хранения; • Регистрация событий по использованию идентификационного и аутентификационного механизмов (вход/выход субъектов доступа в/из системы); • Регистрация действий по администрированию информационной системы; • Регистрация действий технических, встроенных учетных записей и процессов; • Регистрация следующих параметров событий: дата и время, идентификатор субъекта доступа, объект доступа, результат события – успех/отказ. • Мониторинг (просмотр, анализ) результатов регистрации событий безопасности и реагирование на них; • Генерирование временных меток и (или) синхронизация системного времени в информационной системе • Защита информации о событиях безопасности • Обеспечение возможности просмотра и анализа информации о действиях отдельных пользователей в информационной системе."
      },
      {
        "id": 9,
        "header": "Непрерывность работы и отказоустойчивость",
        "text": "Информационная безопасность системы должна быть обеспечена с учетом требований законодательства РФ, нормативных документов федеральных органов исполнительной власти, уполномоченных в области защиты информации, документов Компании. Система функционирует в КСПД Компании. Защита информации должна быть организована в соответствии с нормами, определенными Политикой информационной безопасности Компании. Идентификация и аутентификация пользователей должны быть обеспечены в соответствии со стандартом Компании «Предоставление доступа к информационным ресурсам и ИТ сервисам». Авторизация и управление доступом пользователей к системе должны быть обеспечены в соответствии со следующими нормативными документами Компании: «Предоставление доступа к информационным ресурсам и ИТ сервисам». Процедура авторизации и управления доступом пользователей в системе осуществляется средствами системы ПО. Доступ пользователей к Системе осуществляется в соответствии с назначенными данному пользователю правами доступа. Права доступа назначаются пользователям в соответствии с матрицей доступа. Регистрация и аудит событий безопасности должны обеспечиваться на уровне системных возможностей платформы ПО. Обязательными параметрами регистрации событий безопасности являются время, дата, субъект и объект попытки авторизации в системе, результат попытки. Дополнительные требования к регистрации и аудиту событий не предъявляются. Контроль целостности данных должен обеспечиваться на уровне системных возможностей платформы ПО и СУБД MariaDB. Дополнительные требования к контролю целостности данных не предъявляются. Сохранность данных будет обеспечена путём выполнения регулярного резервного копирования данных. Требования к антивирусной защите предъявляются в соответствие с Политикой информационной безопасности Компании. Дополнительные требования к антивирусной защите не предъявляются. Требования к сетевой безопасности предъявляются в соответствие с Политикой информационной безопасности Компании. Дополнительные требования к сетевой безопасности не предъявляются. Требуется разработка матрицы доступа к информационным ресурсам системы ЛКК в рамках соответствующей спецификации."
      }
    ]
  }
}